package cn.lili.common.enums;

/**
 * @author Chopper
 * @version v4.1
 * @Description: 错误码 5位
 * 第一位 1:商品；2:会员；3:订单,4:店铺,5:页面,6:其他
 * @since 2020/11/17 4:44 下午
 */
public enum MessageCode {

    E401("认证过期"),

    E10001("商品ID不存在"),
    E10002("商品名称不正确，名称应为2-50字符"),
    E10003("此规格已绑定分类不允许删除"),
    E10004("该分类名称已存在"),
    E10005("父分类不存在"),
    E10006("最多为三级分类,添加失败"),
    E10007("此类别下存在子类别不能删除"),
    E10008("此类别下存在商品不能删除"),
    E10009("通过categoryId获取分类失败"),
    E10010("不能重复添加分销商品"),
    E10011("无法将此商品放入回收站"),
    E10012("无法彻底删除从此商品"),
    E10013("无法下架此商品"),
    E10014("无法还原此商品"),


    E20001("用户名密码不能为空"),
    E20002("该用户名已被注册"),
    E20003("该手机号已被注册"),
    E20004("用户不存在"),
    E20005("修改资料成功"),
    E20006("修改资料失败"),
    E20007("手机号不存在"),
    E20008("重置密码成功"),
    E20009("修改手机号成功"),
    E20010("旧密码不正确"),
    E20011("修改密码成功"),
    E20012("用户未登录"),
    E20013("发布评价成功"),
    E20014("领取优惠券成功"),
    E20015("分销商不存在"),
    E20016("分销商已申请，无需重复提交"),
    E20017("密码错误"),
    E20018("分销商清退失败"),
    E20019("审核分销商失败"),
    E20020("用户名或密码错误"),
    E20021("订单状态不允许申请售后，请联系平台或商家"),
    E20022("无权操作此数据！"),
    E20023("此用户已禁用！"),
    E20024("未对当前用户做手机号码校验！"),
    E20025("可提现金额不足！"),
    E20026("零钱提现失败！"),
    E20027("请填写审核备注！"),
    E20028("请勿重复签到"),
    E20029("分销商不存在或已被清退"),
    E20030("分销商提现记录不存在"),
    E20031("分销商提现状态不正确，无法提现"),
    E20032("余额账户不存在，无法操作"),
    E20033("验证码错误，请重新输入"),
    E20034("最多可以设置10个角色"),
    E20035("订单已支付，请勿反复支付"),
    E20036("该订单已部分支付，请前往订单中心进行支付"),
    E20037("余额充值已支付成功，请勿重复支付"),
    E20038("余额不足以支付订单，请充值"),
    E20039("支付业务异常，请稍后重试"),
    E20040("当前订单不需要付款，请返回订单列表重新操作"),
    E20041("非当前用户的手机号"),
    E20101("联合第三方登录，未绑定会员"),
    E20102("联合第三方登录，授权信息错误"),
    E20103("会员发票信息重复"),
    E20104("会员发票信息不存在"),
    E20105("权限不足"),

    E30001("购物车添加成功"),
    E30002("购物车数量更新成功"),
    E30003("购物车选中更新成功"),
    E30004("清空购物车成功"),
    E30005("删除购物车中的一个或多个产品成功"),
    E30006("读取结算页的购物车异常"),
    E30007("创建订单异常，请稍后重试"),
    E30008("订单状态错误，无法进行确认收货"),
    E30009("订单确定收货成功"),
    E30010("订单不存在"),
    E30011("已支付的订单不能修改金额"),
    E30013("物流错误"),
    E30014("当前订单不能发货"),
    E30015("非当前会员的订单"),
    E30016("无法重复提交评价"),
    E30017("付款金额和应付金额不一致"),
    E30018("售后已审核，无法重复操作"),
    E30019("物流公司错误，请重新选择"),
    E30020("请选择要投诉的商品"),
    E30021("当前订单无法核销"),
    E30022("当前售后单无法取消"),
    E30023("当前订单未支付，不能申请售后"),
    E30024("订单已支付，不能再次进行支付"),
    E30025("收银台信息获取错误"),
    E30026("积分不足，不能兑换"),
    E30027("优惠券已使用/已过期，不能使用"),
    E30028("投诉异常，请稍后重试"),

    E40001("非当前店铺数据，无法操作"),
    E40002("此店铺不存在"),
    E40003("店铺名称已存在！"),
    E40004("参数有误！"),
    E40005("已有店铺，无需重复申请"),
    E40006("只有已出账结算单可以核对"),
    E40007("只有已核对结算单可以审核"),
    E40008("只有已审核结算单可以支付"),
    E40009("只有商家可以操作结算单核对"),
    E40010("只有管理可以操作结算单核对"),
    E40011("存在不属于此店铺的商品"),

    E50001("该分类名称已存在"),
    E50002("父分类不存在"),
    E50003("最多为三级分类,添加失败"),
    E50004("最多为三级分类,修改失败"),
    E50005("文章分类名称重复,修改失败"),
    E50006("该文章分类下存在子分类，不能删除"),
    E50007("专题自动发布,无需操作发布"),
    E50008("当前页面为开启状态，无法删除"),
    E50009("当前页面为唯一页面，无法删除"),
    E50010("页面已发布，无需重复提交"),
    E50011("需传入查询ID"),
    E50012("当前消息模板不存在"),
    E50013("短信签名已存在"),
    E50014("该文章分类下存在文章，不能删除"),

    E60000("请先登录再访问此接口"),
    E60001("操作失败"),
    E60002("非法请求"),
    E60003("请求正在处理，请稍后再试"),
    E60004("验证码为空或已过期，请重新获取"),
    E60005("验证失败"),
    E60007("OSS未配置"),
    E60008("支付暂不支持"),
    E60009("错误的客户端"),

    E60010("角色已绑定部门，请逐个删除"),
    E60011("角色已绑定管理员，请逐个删除"),
    E60012("菜单已绑定角色，请先删除或编辑角色"),
    E60013("部门已经绑定管理员，请先删除或编辑管理员"),

    S21001("分销商清退成功"),
    S21002("审核分销商成功"),

    S44000("操作成功"),
    S50001("删除文章分类成功");

    private final String value;

    MessageCode(String value) {
        this.value = value;
    }

    public Integer getCode() {
        return Integer.parseInt(this.name().replace("E", "").replace("S", ""));
    }

    public String getValue() {
        return value;
    }
}
