package cn.lili.common.enums;

/**
 * 日志枚举
 *
 * @author Chopper
 */
public enum StoreLogType {

    /**
     * 默认0操作
     */
    OPERATION,

    /**
     * 1登录
     */
    LOGIN,

    /**
     * 商品
     */

    //商品上架

    //商品下架

    //发布商品

    //修改商品

    //删除商品

    //添加商品模板

    //编辑商品库存

    //增加店铺商品分类

    //编辑店铺商品分类

    /**
     * 订单
     */

    //发货

    //修改收件信息

    /**
     * 售后
     */

    //审核退货单

    //确定收货

    //拒绝收货

    //退款

    //拒绝退款



    /**
     * 营销
     */

    //添加分销商品

    //下架分销商品

    //编辑分销商品

    //创建满减活动

    //编辑满减活动

    //下架满减活动

    //上架满减活动

    //删除满减活动

    //添加优惠券

    //编辑优惠券

    //关闭优惠券

    //参与秒杀活动

    //编辑秒杀活动

    //下架秒杀活动

    //上架秒杀活动

    //删除秒杀活动


    /**
     * 设置
     */

    //选择物流公司

    //取消物流公司

    //添加运费模板

    //编辑运费模板

    //删除运费模板

    //设置店铺信息

    //修改店铺退货地址

    //新增自提点

    //编辑自提点

    //删除自提点

    //发布店铺首页

}
